app/controllers/posts_controller.rb

  def update
    set_post
    @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My Edit"], ["description", "My post description"], ["updated_at", "2016-01-27 20:09:01.104499"], ["id", 1]]